var charts = {

    names: ['微信', '百度', '微博'],
    lineX: ['1月10日','1月11日','1月12日','1月13日','1月14日','1月15日','1月16日','1月17日','1月18日','1月19日','1月20日','1月21日','1月22日','1月23日','1月24日','1月25日','1月26日','1月27日','1月28日','1月29日','1月30日','1月31日','2月1日','2月2日','2月3日','2月4日','2月5日','2月6日','2月7日','2月8日','2月9日','2月10日','2月11日','2月12日','2月13日','2月14日','2月15日','2月16日','2月17日','2月18日','2月19日','2月20日','2月21日','2月22日','2月23日','2月24日','2月25日','2月26日','2月27日','2月28日','2月29日','3月1日','3月2日','3月3日','3月4日','3月5日','3月6日','3月7日','3月8日','3月9日','3月10日','3月11日','3月12日','3月13日','3月14日','3月15日','3月16日','3月17日'],
    value: [
        [0.14 ,0.18 ,0.15 ,0.15 ,0.13 ,0.28 ,0.15 ,0.18 ,0.21 ,0.32 ,0.56 ,0.56 ,0.59 ,0.47 ,0.50 ,0.42 ,0.42 ,0.42 ,0.45 ,0.44 ,0.42 ,0.39 ,0.40 ,0.37 ,0.39 ,0.37 ,0.38 ,0.38 ,0.36 ,0.38 ,0.38 ,0.37 ,0.35 ,0.36 ,0.36 ,0.37 ,0.34 ,0.33 ,0.33 ,0.33 ,0.32 ,0.33 ,0.33 ,0.31 ,0.31 ,0.30 ,0.30 ,0.30 ,0.29 ,0.29 ,0.30 ,0.29 ,0.29 ,0.29 ,0.29 ,0.28 ,0.28 ,0.27 ,0.29 ,0.27 ,0.27 ,0.28 ,0.27 ,0.29 ,0.29 ,0.30 ,0.28 ,0.28],
        [0.46 ,0.46 ,0.45 ,0.48 ,0.45 ,0.41 ,0.42 ,0.41 ,0.39 ,0.47 ,0.51 ,0.44 ,0.48 ,0.34 ,0.38 ,0.35 ,0.33 ,0.31 ,0.30 ,0.28 ,0.26 ,0.25 ,0.26 ,0.26 ,0.25 ,0.24 ,0.24 ,0.23 ,0.23 ,0.23 ,0.22 ,0.21 ,0.21 ,0.20 ,0.20 ,0.20 ,0.20 ,0.18 ,0.17 ,0.17 ,0.16 ,0.16 ,0.15 ,0.15 ,0.15 ,0.15 ,0.15 ,0.14 ,0.14 ,0.14 ,0.14 ,0.14 ,0.13 ,0.13 ,0.13 ,0.13 ,0.13 ,0.13 ,0.13 ,0.12 ,0.13 ,0.13 ,0.13 ,0.13 ,0.13 ,0.13 ,0.13 ,0.12],
        [0.04 ,0.27 ,0.09 ,0.11 ,0.05 ,0.20 ,0.18 ,0.28 ,0.35 ,0.46 ,0.45 ,0.40 ,0.37 ,0.32 ,0.33 ,0.31 ,0.32 ,0.32 ,0.33 ,0.33 ,0.31 ,0.27 ,0.24 ,0.28 ,0.22 ,0.27 ,0.24 ,0.30 ,0.31 ,0.23 ,0.22 ,0.27 ,0.22 ,0.20 ,0.20 ,0.22 ,0.19 ,0.22 ,0.20 ,0.23 ,0.20 ,0.21 ,0.23 ,0.22 ,0.25 ,0.26 ,0.24 ,0.35 ,0.31 ,0.28 ,0.37 ,0.28 ,0.19 ,0.33 ,0.27 ,0.29 ,0.26 ,0.27 ,0.20 ,0.20 ,0.32 ,0.29 ,0.34 ,0.32 ,0.29 ,0.31 ,0.29 ,0.25]
    ]

}
var color = ['rgba(23, 255, 243', 'rgba(255,100,97', 'rgba(238,255,0']
var lineY = []

for (var i = 0; i < charts.names.length; i++) {
    var x = i
    if (x > color.length - 1) {
        x = color.length - 1
    }
    var data = {
        name: charts.names[i],
        type: 'line',
        color: color[x] + ')',
        smooth: true,
        areaStyle: {
            normal: {
                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                    offset: 0,
                    color: color[x] + ', 0.3)'
                }, {
                    offset: 0.8,
                    color: color[x] + ', 0)'
                }], false),
                shadowColor: 'rgba(0, 0, 0, 0.1)',
                shadowBlur: 10
            }
        },
        symbol: 'circle',
        symbolSize: 5,
        data: charts.value[i]
    }
    lineY.push(data)
}

lineY[0].markLine = {
    silent: true,
    data: [{
        yAxis: 5
    }, {
        yAxis: 100
    }, {
        yAxis: 200
    }, {
        yAxis: 300
    }, {
        yAxis: 400
    }]
}
var option = {
    backgroundColor: '#040f3c',
    tooltip: {
        trigger: 'axis'
    },
    legend: {
        data: charts.names,
        textStyle: {
            fontSize: 20,
            color: '#fff'
        },
        right: '4%'
    },
    grid: {
        top: '14%',
        left: '4%',
        right: '4%',
        bottom: '12%',
        containLabel: true
    },
    xAxis: {
        type: 'category',
        boundaryGap: false,
        data: charts.lineX,
        axisLabel: {
            textStyle: {
                color: '#fff'
            },
            formatter: function(params) {
                return params.split(' ')[0]
            }
        }
    },
    yAxis: {
        name: charts.unit,
        type: 'value',
        axisLabel: {
            formatter: '{value}',
            textStyle: {
                color: '#fff'
            }
        },
        splitLine: {
            lineStyle: {
                color: 'rgb(23,255,243,0.3)'
            }
        },
        axisLine: {
            lineStyle: {
                color: 'rgb(0,253,255,0.6)'
            }
        }
    },
    series: lineY
}
var myChart = echarts.init(document.getElementById('keyWords1'))
myChart.setOption(option)